<a href="https://colab.research.google.com/github/Ashish265/Kata/blob/master/practise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [80]:
import pandas as pd
import numpy as np

In [81]:
b = [["123"] for i in range(1,6)] + [["345"] for i in range(1,6)] + [["786"] for i in range(1,6)]

In [82]:
df = pd.DataFrame([[i]for i in range(1,16)])

In [83]:
df1 = pd.DataFrame(b)

In [84]:
df1

      0
0   123
1   123
2   123
3   123
4   123
5   345
6   345
7   345
8   345
9   345
10  786
11  786
12  786
13  786
14  786

In [85]:
page = [1,2,1,3,4,1,3,7,5,2,2,4,6,8,10]

In [86]:
time = ["12:30:05",
        "12:33:07",
        "12:34:15",
        "12:38:17",
        "12:45:06",
        "13:13:05",
        "14:33:07",
        "13:34:15",
        "12:58:17",
        "12:55:06",
        "02:00:47",
        "14:08:55",
        "08:57:08",
        "17:47:06","08:30:38"]

In [87]:
df_page= pd.DataFrame([[i]for i in page])

In [88]:
df_time= pd.DataFrame([[i]for i in time])

In [89]:
df_time

           0
0   12:30:05
1   12:33:07
2   12:34:15
3   12:38:17
4   12:45:06
5   13:13:05
6   14:33:07
7   13:34:15
8   12:58:17
9   12:55:06
10  02:00:47
11  14:08:55
12  08:57:08
13  17:47:06
14  08:30:38

In [90]:
df.rename(columns = {0:"ID"},inplace=True)

In [91]:
df1.rename(columns = {0:"user_ID"},inplace=True)

In [92]:
df_page.rename(columns = {0:"page_id"},inplace=True)

In [93]:
df_time.rename(columns={0:"page_start_time"},inplace=True)

In [94]:
df_final = pd.concat([df,df1,df_page,df_time],axis=1)

In [95]:
df_final

    ID user_ID  page_id page_start_time
0    1     123        1        12:30:05
1    2     123        2        12:33:07
2    3     123        1        12:34:15
3    4     123        3        12:38:17
4    5     123        4        12:45:06
5    6     345        1        13:13:05
6    7     345        3        14:33:07
7    8     345        7        13:34:15
8    9     345        5        12:58:17
9   10     345        2        12:55:06
10  11     786        2        02:00:47
11  12     786        4        14:08:55
12  13     786        6        08:57:08
13  14     786        8        17:47:06
14  15     786       10        08:30:38

In [96]:
df_final['page_start_time'] = pd.to_datetime(df_final['page_start_time'],format= '%H:%M:%S' ).dt.time

In [97]:
df_final.reset_index(inplace=True,drop=True)